src/DocumentJournals/ЭлектроннаяПочта/ЭлектроннаяПочта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>ЭлектроннаяПочта</name>
  <registeredDocuments>Document.ВходящееПисьмо</registeredDocuments>
  <registeredDocuments>Document.ИсходящееПисьмо</registeredDocuments>
  <columns>
    <name>Адресаты</name>
  </columns>
  <columns>
    <name>Важность</name>
  </columns>
  <columns>
    <name>ВидМаршрутизации</name>
  </columns>
  <columns>
    <name>ДатаОтправкиПолучения</name>
  </columns>
  <columns>
    <name>ЕстьВложения</name>
  </columns>
  <columns>
    <name>Комментарий</name>
  </columns>
  <columns>
    <name>НомерСпособаАдресации</name>
  </columns>
  <columns>
    <name>Отправитель</name>
  </columns>
  <columns>
    <name>ОтправкаОтменена</name>
  </columns>
  <columns>
    <name>Отправлено</name>
  </columns>
  <columns>
    <name>Папка</name>
  </columns>
  <columns>
    <name>Получатели</name>
  </columns>
  <columns>
    <name>Получено</name>
  </columns>
  <columns>
    <name>Предмет</name>
  </columns>
  <columns>
    <name>Размер</name>
  </columns>
  <columns>
    <name>Тема</name>
  </columns>
  <columns>
    <name>УчетнаяЗапись</name>
  </columns>
</mdclass:DocumentJournal>

src/Catalogs/ТипыСвязей/ТипыСвязей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыСвязей</name>
  <predefined>
    <items>
      <name>АвансовыйОтчет</name>
      <description>Авансовый отчет</description>
    </items>
    <items>
      <name>ВходитВКомплект</name>
      <description>Входит в комплект</description>
    </items>
    <items>
      <name>ДелаетНеДействующим</name>
      <description>Делает недействующим</description>
    </items>
    <items>
      <name>Исправление</name>
      <description>Исправление</description>
    </items>
    <items>
      <name>ИсправлениеК</name>
      <description>Исправление к</description>
    </items>
    <items>
      <name>Корректировка</name>
      <description>Корректировка</description>
    </items>
    <items>
      <name>КорректировкаК</name>
      <description>Корректировка к</description>
    </items>
    <items>
      <name>НаОснованииПисьма</name>
      <description>На основании письма</description>
    </items>
    <items>
      <name>НеДействуетВСоответствии</name>
      <description>Не действует в соответствии</description>
    </items>
    <items>
      <name>ОплатаПоЗаявке</name>
      <description>Оплата по заявке</description>
    </items>
    <items>
      <name>ОплаченоДокументом</name>
      <description>Оплачено документом</description>
    </items>
    <items>
      <name>ОтправилоДокумент</name>
      <description>Отправило документ</description>
    </items>
    <items>
      <name>ОтправленВОтветНа</name>
      <description>Отправлен в ответ на</description>
    </items>
    <items>
      <name>ВОтветНаПереадресованное</name>
      <description>Отправлен в ответ на переадресованное</description>
    </items>
    <items>
      <name>ОтправленВОтветНаПисьмо</name>
      <description>Отправлен в ответ на письмо</description>
    </items>
    <items>
      <name>ОтправленОтвет</name>
      <description>Отправлен ответ</description>
    </items>
    <items>
      <name>ОтветПереадресовавшему</name>
      <description>Отправлен ответ переадресовавшему</description>
    </items>
    <items>
      <name>ОтправленОтветныйДокумент</name>
      <description>Отправлен ответный документ</description>
    </items>
    <items>
      <name>ОтправленоОтветноеПисьмо</name>
      <description>Отправлено ответное письмо</description>
    </items>
    <items>
      <name>ПереадресацияДокумента</name>
      <description>Переадресация документа</description>
    </items>
    <items>
      <name>ПереадресацияДокументаПоВопросу</name>
      <description>Переадресация документа по вопросу</description>
    </items>
    <items>
      <name>ПереадресованДокументом</name>
      <description>Переадресован документом</description>
    </items>
    <items>
      <name>ПереадресованДокументомПоВопросу</name>
      <description>Переадресован документом по вопросу</description>
    </items>
    <items>
      <name>ПеренаправлениеПисьма</name>
      <description>Перенаправление письма</description>
    </items>
    <items>
      <name>ПеренаправленоПисьмом</name>
      <description>Перенаправлено письмом</description>
    </items>
    <items>
      <name>ПерепискаПоПредмету</name>
      <description>Переписка по предмету</description>
    </items>
    <items>
      <name>ПересланоПисьмом</name>
      <description>Переслано письмом</description>
    </items>
    <items>
      <name>ПересылкаПисьма</name>
      <description>Пересылка письма</description>
    </items>
    <items>
      <name>ПисьмоОтправленоВОтветНа</name>
      <description>Письмо отправлено в ответ на</description>
    </items>
    <items>
      <name>ПисьмоОснование</name>
      <description>Письмо-основание</description>
    </items>
    <items>
      <name>ПолученВОтветНа</name>
      <description>Получен в ответ на</description>
    </items>
    <items>
      <name>ПолученВОтветНаПисьмо</name>
      <description>Получен в ответ на письмо</description>
    </items>
    <items>
      <name>ПолученОтвет</name>
      <description>Получен ответ</description>
    </items>
    <items>
      <name>ПолученОтветныйДокумент</name>
      <description>Получен ответный документ</description>
    </items>
    <items>
      <name>ПолученоВОтветНаДокумент</name>
      <description>Получено в ответ на документ</description>
    </items>
    <items>
      <name>ПолученоВОтветНаПисьмо</name>
      <description>Получено в ответ на письмо</description>
    </items>
    <items>
      <name>ПолученоОтветноеПисьмо</name>
      <description>Получено ответное письмо</description>
    </items>
    <items>
      <name>ПредметОплаты</name>
      <description>Предмет оплаты</description>
    </items>
    <items>
      <name>Содержит</name>
      <description>Содержит</description>
    </items>
    <items>
      <name>ПредметПереписки</name>
      <description>Содержит переписку по</description>
    </items>
    <items>
      <name>СодержитСсылкуНаИнтегрированныйОбъект</name>
      <description>Содержит ссылку на</description>
    </items>
    <items>
      <name>СоздалоДокумент</name>
      <description>Создало документ</description>
    </items>
    <items>
      <name>ОсновноеОбращение</name>
      <description>Является дубликатом для</description>
    </items>
    <items>
      <name>Дубликат</name>
      <description>Является основным для</description>
    </items>
    <items>
      <name>ПовторноеОбращение</name>
      <description>Является первичным для</description>
    </items>
    <items>
      <name>ПервичноеОбращение</name>
      <description>Является повторным для</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DocumentJournals/ЭлектроннаяПочта/Forms/РеквизитыПисьма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Ссылка = Параметры.Ссылка;
	ОтобразитьСвязиПисьма();
	
	ВнешнееПисьмоТекстЗаголовка = Параметры.ВнешнееПисьмоТекстЗаголовка; 
	ВнешнееПисьмоТекстСообщения = Параметры.ВнешнееПисьмоТекстСообщения; 
	ВидМаршрутизацииТекстЗаголовка = Параметры.ВидМаршрутизацииТекстЗаголовка; 
	ВидМаршрутизацииТекстСообщения = Параметры.ВидМаршрутизацииТекстСообщения;
	
	РеквизитыПисьма = Неопределено;
	Если ЗначениеЗаполнено(Ссылка) Тогда 
		РеквизитыПисьма = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
			"ДатаОтправки, Дата, УчетнаяЗапись, Папка, Предмет, Проект, Важность");
	Иначе
			
		РеквизитыПисьма = Новый Структура(
			"ДатаОтправки, Дата, УчетнаяЗапись, Папка, Предмет, Проект, Важность", 
			Неопределено, Неопределено, 
			Параметры.УчетнаяЗапись, Параметры.Папка, Параметры.Предмет, 
			Параметры.Проект, Параметры.Важность);
			
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(Параметры.Предмет) Тогда
		РеквизитыПисьма.Предмет = Параметры.Предмет;
	КонецЕсли;	
	Если ЗначениеЗаполнено(Параметры.Проект) Тогда
		РеквизитыПисьма.Проект = Параметры.Проект;
	КонецЕсли;	
	
	ДатаОтправки = РеквизитыПисьма.ДатаОтправки;
	Дата = РеквизитыПисьма.Дата;
	Если ВстроеннаяПочтаКлиентСервер.ЭтоВходящееПисьмо(Ссылка) Тогда
		ДатаПолучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,
			"ДатаПолучения");
	КонецЕсли;	
	УчетнаяЗапись = РеквизитыПисьма.УчетнаяЗапись;
	Папка = РеквизитыПисьма.Папка;
	Предмет = РеквизитыПисьма.Предмет;
	
	Проект = РеквизитыПисьма.Проект;
	
	ВажностьНадпись = РеквизитыПисьма.Важность;
	
	Строка = ИнформацияПисьма.Добавить();
	Строка.Имя = НСтр("ru = 'В ответ на'");
	Строка.Значение = ПолученоВОтветНаСтрока;
	Строка.ТолькоПросмотр = Истина;
	Строка.ЭтоГиперссылка = ПолученоВОтветНаЭтоГиперссылка;
	
	Строка = ИнформацияПисьма.Добавить();
	Строка.Имя = НСтр("ru = 'Отправлен ответ'");
	Строка.Значение = ОтправленОтветСтрока;
	Строка.ЭтоГиперссылка = (ОтправленОтвет.Количество() <> 0);
	
	Строка = ИнформацияПисьма.Добавить();
	Строка.Имя = НСтр("ru = 'Переслано'");
	Строка.Значение = ПересланоПисьмомСтрока;
	Строка.ЭтоГиперссылка = ПересланоПисьмомЭтоГиперссылка;
	
	Строка = ИнформацияПисьма.Добавить();
	Строка.Имя = НСтр("ru = 'Переписка'");
	Строка.Значение = ПисемВПереписке;
	Строка.ЭтоГиперссылка = (ЧислоПисемВПереписке > 1);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыИЗадачи") Тогда
		Строка = ИнформацияПисьма.Добавить();
		Строка.Имя = НСтр("ru = 'Задачи'");
		Строка.Значение = Задачи;
		КоличествоАктивныхЗадач = АктивныеЗадачиПоПисьму.Количество();
		Строка.ЭтоГиперссылка = (КоличествоАктивныхЗадач > 0);
	КонецЕсли;
	
	Строка = ИнформацияПисьма.Добавить();
	Строка.Имя = НСтр("ru = 'Отправлено'");
	Строка.Значение = РеквизитыПисьма.ДатаОтправки;
	Строка.ТолькоПросмотр = Истина;
	
	Если ВстроеннаяПочтаКлиентСервер.ЭтоВходящееПисьмо(Ссылка) Тогда
		Строка = ИнформацияПисьма.Добавить();
		Строка.Имя = НСтр("ru = 'Получено'");
		Строка.Значение = РеквизитыПисьма.Дата;
		Строка.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Строка = ИнформацияПисьма.Добавить();
	Строка.Имя = НСтр("ru = 'Учетная запись'");
	Строка.УчетнаяЗапись = РеквизитыПисьма.УчетнаяЗапись;
	Строка.ЭтоУчетнаяЗапись = Истина;
	
	Строка = ИнформацияПисьма.Добавить();
	Строка.Имя = НСтр("ru = 'Папка'");
	Строка.Папка = Папка;
	Строка.ЭтоПапка = Истина;
	
	Строка = ИнформацияПисьма.Добавить();
	Строка.Имя = НСтр("ru = 'Предмет'");
	Строка.Предмет = РеквизитыПисьма.Предмет;
	Строка.ЭтоПредмет = Истина;
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам") Тогда
		Строка = ИнформацияПисьма.Добавить();
		Строка.Имя = НСтр("ru = 'Проект'");
		Строка.Проект = РеквизитыПисьма.Проект;
		Строка.ЭтоПроект = Истина;
	КонецЕсли;
	
	ИспользоватьВнутреннююМаршрутизацию = Константы.ИспользоватьВнутреннююМаршрутизацию.Получить();
	Если ИспользоватьВнутреннююМаршрутизацию Тогда 
		
		Строка = ИнформацияПисьма.Добавить();
		Строка.Имя = НСтр("ru = 'Вид маршрутизации'");
		Строка.Значение = Параметры.ВидМаршрутизации;
		Строка.ЭтоГиперссылка = Истина;
		
	КонецЕсли;	
	
	Строка = ИнформацияПисьма.Добавить();
	Строка.Имя = НСтр("ru = 'Адресация'");
	Строка.Значение = Параметры.ВнешнееПисьмо;
	Строка.ЭтоГиперссылка = Истина;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		НастроитьЭлементыФормыДляМобильногоУстройства();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Для Каждого Строка Из ИнформацияПисьма Цикл
		
		Если Строка.Имя = НСтр("ru = 'Учетная запись'") Тогда
			УчетнаяЗапись = Строка.УчетнаяЗапись;
		КонецЕсли;	
		Если Строка.Имя = НСтр("ru = 'Папка'") Тогда
			Папка = Строка.Папка;
		КонецЕсли;	
		Если Строка.Имя = НСтр("ru = 'Предмет'") Тогда
			Предмет = Строка.Предмет;
		КонецЕсли;	
		Если Строка.Имя = НСтр("ru = 'Проект'") Тогда
			Проект = Строка.Проект;
		КонецЕсли;	
		
	КонецЦикла;	
	
	ПараметрыВозврата = Новый Структура("Письмо, Предмет, Проект, УчетнаяЗапись, Папка",
		Ссылка, Предмет, Проект, УчетнаяЗапись, Папка);

	Закрыть(ПараметрыВозврата);
	
КонецПроцедуры


&НаКлиенте
Процедура ИнфаПисьмаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Данные = ИнформацияПисьма.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если Данные.Имя = "Переписка" Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(Ссылка) Тогда
			ВстроеннаяПочтаКлиент.ОткрытьДеревоПереписки(Ссылка);
		КонецЕсли;	
	КонецЕсли;
	
	Если Данные.Имя = НСтр("ru = 'В ответ на'") Тогда 
		
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ПолученоВОтветНа) Тогда
			ПоказатьЗначение(,ПолученоВОтветНа);
		КонецЕсли;	
		
	КонецЕсли;
	
	Если Данные.Имя = НСтр("ru = 'Отправлен ответ'") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ОтправленОтвет.Количество() = 1 Тогда
			ПоказатьЗначение(, ОтправленОтвет[0].Значение);
		ИначеЕсли ОтправленОтвет.Количество() > 1 Тогда
			ВстроеннаяПочтаКлиент.ОткрытьДеревоПереписки(Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Данные.Имя = НСтр("ru = 'Переслано'") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ПересланоПисьмом.Количество() = 1 Тогда
			ПоказатьЗначение(, ПересланоПисьмом[0].Значение);
		ИначеЕсли ПересланоПисьмом.Количество() > 1 Тогда
			ВстроеннаяПочтаКлиент.ОткрытьДеревоПереписки(Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	Если Данные.Имя = НСтр("ru = 'Задачи'") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если АктивныеЗадачиПоПисьму.Количество() = 1 Тогда
			ПоказатьЗначение(, АктивныеЗадачиПоПисьму[0].Значение);
		ИначеЕсли АктивныеЗадачиПоПисьму.Количество() > 1 Тогда
			ОткрытьОбщуюФормуБизнесПроцессыИЗадачиПоПредмету();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Данные.Имя = НСтр("ru = 'Вид маршрутизации'") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", ВидМаршрутизацииТекстЗаголовка);
		ПараметрыФормы.Вставить("ТекстСообщения", ВидМаршрутизацииТекстСообщения);
		
		ОткрытьФорму("ОбщаяФорма.ФорматированноеСообщение", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;
	
	Если Данные.Имя = НСтр("ru = 'Адресация'") Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", ВнешнееПисьмоТекстЗаголовка);
		ПараметрыФормы.Вставить("ТекстСообщения", ВнешнееПисьмоТекстСообщения);
		
		ОткрытьФорму("ОбщаяФорма.ФорматированноеСообщение", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфаПисьмаПередНачаломИзменения(Элемент, Отказ)
	
	Данные = ИнформацияПисьма.НайтиПоИдентификатору(Элементы.ИнформацияПисьма.ТекущаяСтрока);
	
	Если Данные.Имя <> НСтр("ru = 'Учетная запись'") И Данные.Имя <> НСтр("ru = 'Папка'")
		И Данные.Имя <> НСтр("ru = 'Предмет'") И Данные.Имя <> НСтр("ru = 'Проект'") Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфаПисьмаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИнфаПисьмаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтобразитьСвязиПисьма()
	
	ПолучатьПомеченныеНаУдаление = Ложь; 
	ВсеСвязиДокумента = СвязиДокументов.ПолучитьВсеСвязиДокумента(Ссылка, ПолучатьПомеченныеНаУдаление);
	Если ВсеСвязиДокумента.Количество() > 0 Тогда
		
		// ПолученоВОтветНаДокумент
		НайденнаяСтрока = ВсеСвязиДокумента.Найти(
			Справочники.ТипыСвязей.ПолученоВОтветНаДокумент,
			"ТипСвязи");
		Если НайденнаяСтрока <> Неопределено Тогда
			ПолученоВОтветНаДокумент = НайденнаяСтрока.СвязанныйДокумент;			
			ПолученоВОтветНа = ПолученоВОтветНаДокумент;
		Иначе
			// ПолученоВОтветНаПисьмо
			НайденнаяСтрока = ВсеСвязиДокумента.Найти(
				Справочники.ТипыСвязей.ПолученоВОтветНаПисьмо,
				"ТипСвязи");
				
			Если НайденнаяСтрока <> Неопределено Тогда
				ПолученоВОтветНаПисьмо = НайденнаяСтрока.СвязанныйДокумент;
				ПолученоВОтветНа = ПолученоВОтветНаПисьмо;
			КонецЕсли;
			
		КонецЕсли;
		
		ОтправленОтвет.Очистить();
		СтруктураОтбора = Новый Структура("ТипСвязи", Справочники.ТипыСвязей.ОтправленоОтветноеПисьмо);
		НайденныеСтроки = ВсеСвязиДокумента.НайтиСтроки(СтруктураОтбора);
		Для каждого Строка Из НайденныеСтроки Цикл
			ОтправленОтвет.Добавить(Строка.СвязанныйДокумент);
		КонецЦикла;
		
		СтруктураОтбора = Новый Структура("ТипСвязи", Справочники.ТипыСвязей.ОтправленОтветныйДокумент);
		НайденныеСтроки = ВсеСвязиДокумента.НайтиСтроки(СтруктураОтбора);
		Для каждого Строка Из НайденныеСтроки Цикл
			ОтправленОтвет.Добавить(Строка.СвязанныйДокумент);
		КонецЦикла;
		
		СтруктураОтбора = Новый Структура("ТипСвязи", Справочники.ТипыСвязей.ПересланоПисьмом);
		НайденныеСтроки = ВсеСвязиДокумента.НайтиСтроки(СтруктураОтбора);
		Для каждого Строка Из НайденныеСтроки Цикл
			ПересланоПисьмом.Добавить(Строка.СвязанныйДокумент);
		КонецЦикла;
		
	КонецЕсли;
	
	// Обработка связи письма ПолученоВОтветНа
	Если ЗначениеЗаполнено(ПолученоВОтветНа) Тогда
		Если ВстроеннаяПочтаКлиентСервер.ЭтоПисьмо(ПолученоВОтветНа) Тогда
			ПолученоВОтветНаСтрока = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПолученоВОтветНа, "Тема");
			ПолученоВОтветНаЭтоГиперссылка = Истина;
		ИначеЕсли ДелопроизводствоКлиентСервер.ЭтоИсходящийДокумент(ПолученоВОтветНа) ТОгда
			ПолученоВОтветНаСтрока = Строка(ПолученоВОтветНа);
			ПолученоВОтветНаЭтоГиперссылка = Истина;
		Иначе
			ПолученоВОтветНаСтрока = НСтр("ru = 'Нет'");
			ПолученоВОтветНаЭтоГиперссылка = Ложь;
		КонецЕсли;
	Иначе
		ПолученоВОтветНаСтрока = НСтр("ru = 'Нет'");
		ПолученоВОтветНаЭтоГиперссылка = Ложь;
	КонецЕсли;
	
	// Обработка связи письма ОтправленОтвет
	Если ОтправленОтвет.Количество() = 0 Тогда
		ОтправленОтветСтрока = НСтр("ru = 'Нет'");
	Иначе
		ОтправленОтветСтрока = "";
		Для каждого Ответ Из ОтправленОтвет Цикл
			Если ДелопроизводствоКлиентСервер.ЭтоИсходящийДокумент(Ответ.Значение) Тогда
				ОтправленОтветСтрока = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					Ответ.Значение,
					"Заголовок");
				Если Не ЗначениеЗаполнено(ОтправленОтветСтрока) Тогда
					ОтправленОтветСтрока = НСтр("ru = 'Документ без заголовка'");
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ЗначениеЗаполнено(ОтправленОтветСтрока) Тогда
			Для каждого Ответ Из ОтправленОтвет Цикл
				Если ВстроеннаяПочтаКлиентСервер.ЭтоИсходящееПисьмо(Ответ.Значение) Тогда
					ОтправленОтветСтрока = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
						Ответ.Значение,
						"Тема");
					Если Не ЗначениеЗаполнено(ОтправленОтветСтрока) Тогда
						ОтправленОтветСтрока = НСтр("ru = 'Письмо без темы'");
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Обработка связи письма ПересланоПисьмом
	Если ПересланоПисьмом.Количество() = 0 Тогда
		ПересланоПисьмомСтрока = НСтр("ru = 'Нет'");
		ПересланоПисьмомЭтоГиперссылка = Ложь;
	Иначе
		ПересланоПисьмомТема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ПересланоПисьмом[0].Значение,
			"Тема");
		ПересланоПисьмомСтрока = ПересланоПисьмомТема;
		ПересланоПисьмомЭтоГиперссылка = Истина;
	КонецЕсли;
	
	ЧислоПисемВПереписке = ВстроеннаяПочтаСервер.ПолучитьКоличествоПисемВПереписке(Ссылка);
	Если ЧислоПисемВПереписке > 1 Тогда
		ПисемВПереписке = Формат(ЧислоПисемВПереписке, "ЧН=0") +
			" " +
			ВстроеннаяПочтаКлиентСервер.ПодписьКЧислуПисемСтрокой(ЧислоПисемВПереписке);
	Иначе
		ПисемВПереписке = НСтр("ru = 'Писем нет'");
	КонецЕсли;
	
	АктивныеЗадачиПоПисьму.ЗагрузитьЗначения(ПолучитьАктивныеЗадачиПоПисьму(Ссылка)); 
	КоличествоАктивныхЗадач = АктивныеЗадачиПоПисьму.Количество();
	Если КоличествоАктивныхЗадач > 1 Тогда
		Задачи = Формат(КоличествоАктивныхЗадач, "ЧН=0") +
			" " +
			ВстроеннаяПочтаКлиентСервер.ПодписьКЧислуЗадачСтрокой(КоличествоАктивныхЗадач);
		
	ИначеЕсли КоличествоАктивныхЗадач = 1 Тогда
		Задачи = АктивныеЗадачиПоПисьму[0];
	Иначе
		Задачи = НСтр("ru = 'Нет задач'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАктивныеЗадачиПоПисьму(Письмо)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.Предметы.Предмет = &Предмет
		|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
		|	И НЕ ЗадачаИсполнителя.Отменена
		|	И НЕ ЗадачаИсполнителя.Выполнена
		|	И ЗадачаИсполнителя.СостояниеБизнесПроцесса = ЗНАЧЕНИЕ(Перечисление.СостоянияБизнесПроцессов.Активен)");
	Запрос.УстановитьПараметр("Предмет", Письмо);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ОткрытьОбщуюФормуБизнесПроцессыИЗадачиПоПредмету()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Предмет", Ссылка);
	ПараметрыФормы.Вставить(
		"Заголовок",
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процессы и задачи по предмету: ""%1""'"),
			Заголовок));
	ОткрытьФорму(
		"ОбщаяФорма.ПроцессыИЗадачи",
		ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыДляМобильногоУстройства()
	
	ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Верх;
	Элементы.ФормаОК.Картинка = БиблиотекаКартинок.ЗаписатьИЗакрыть;
	
КонецПроцедуры


#КонецОбласти
